//4. С клавиатуры вводится шестизначное натуральное число. Написать программу, которая определяет,
//является ли это число «счастливым» (т.е. сумма первых трёх цифр равняется сумме последних трёх цифр).
#include <iostream>

int main() {
    std::cout << "Введите 6-ти значное число" << std::endl;
    int n;
    std::cin >> n;

    bool answer = (((n % 10) + (n % 100 / 10) + (n % 1000 / 100)) == ((n / 100000) + (n / 10000 % 10) + (n / 1000 % 10)));

    if (answer) {
        std::cout << "счастливое" << std::endl;
    } else {
        std::cout << "не счастливое" << std::endl;
    }

    return 0;
}
